[
  {
    "id": 1,
    "votes": 0,
    "description": "Створіть простий додаток таймера, який відлічує час у зворотньому відліку.",
    "participants": [],
    "skills": "HTML для структури, CSS для базового стилю, використання стану React для управління відліком часу.",
    "title": "Звичайний додаток таймера"
  },
  {
    "id": 2,
    "votes": 0,
    "description": "Реалізуйте просту інтерактивну анімацію, таку як рух об\"єктів при наведенні курсору миші.",
    "participants": [],
    "skills": "HTML, CSS для базового макету, React для обробки подій і анімації.",
    "title": "Проста інтерактивна анімація"
  },
  {
    "id": 3,
    "description": "Створіть додаток із списком завдань, що дозволяє користувачам додавати, видаляти та відмічати завдання як виконані.",
    "participants": [],
    "skills": "HTML, CSS для простого стилю, керування станом у React для управління списком завдань.",
    "title": "Додаток із списком завдань",
    "votes": 0
  },
  {
    "id": 4,
    "description": "Розробіть простий блог, де користувачі можуть переглядати статті та залишати коментарі, використовуючи менеджер стану в React.",
    "participants": [],
    "skills": "HTML, CSS для базового макету, керування станом та управління даними в React.",
    "title": "Менеджер стану простого блогу",
    "votes": 0
  },
  {
    "id": 5,
    "description": "Створіть додаток для відстеження витрат, який дозволяє користувачам додавати та видаляти витрати та розраховувати загальну суму.",
    "participants": [],
    "skills": "HTML, CSS для простого стилю, керування станом у React для управління витратами.",
    "title": "Калькулятор витрат",
    "votes": 0
  },
  {
    "id": 6,
    "skills": "HTML, CSS для простої структури, використання бібліотеки для карт у React для відображення інтерактивної карти.",
    "title": "Інтерактивна карта",
    "description": "Реалізуйте інтерактивну карту, яка демонструє різні місця на основі користувацького вибору.",
    "participants": [],
    "votes": 0
  },
  {
    "description": "Створіть просту гру \"Memory\", де користувачі повинні знайти парні картки, запам\"ятовуючи їх розташування.",
    "id": 7,
    "participants": [],
    "skills": "HTML, CSS для базового макету, React для керування логікою гри та станом карток.",
    "title": "Проста гра \"Memory\"",
    "votes": 0
  },
  {
    "votes": 0,
    "description": "Розробіть простий додаток для відтворення музики, який дозволяє користувачам вибирати та відтворювати пісні.",
    "id": 8,
    "participants": [],
    "skills": "HTML, CSS для простого стилю, використання аудіооб\"єктів та керування станом у React для відтворення музики.",
    "title": "Додаток для відтворення музики"
  },
  {
    "id": 9,
    "participants": [],
    "skills": "HTML, CSS для простого стилю, використання API для отримання курсів валют та керування станом у React для конвертації.",
    "title": "Конвертер валют",
    "votes": 0,
    "description": "Створіть додаток для конвертації валют, який дозволяє користувачам переводити суми з однієї валюти в іншу."
  },
  {
    "description": "Створіть веб-додаток блогу, який дозволяє користувачам переглядати, створювати, редагувати та видаляти записи.",
    "id": 10,
    "participants": [],
    "skills": "HTML, CSS для простого дизайну, робота з сервером або фейковим API в React для управління даними блогу.",
    "title": "Загальний блог",
    "votes": 0
  },
  {
    "description": "Розробіть додаток, який показує прогноз погоди для певного місця на основі даних, отриманих з погодного API.",
    "id": 11,
    "participants": [],
    "skills": "HTML, CSS для простого стилю, використання погодного API та відображення даних у React.",
    "title": "Додаток для прогнозу погоди",
    "votes": 0
  },
  {
    "votes": 0,
    "description": "Створіть простий клон соціальної мережі, де користувачі можуть створювати дописи, додавати друзів та коментувати дописи.",
    "id": 12,
    "participants": [],
    "skills": "HTML, CSS для базового макету, робота з сервером або фейковим API в React для управління даними користувачів.",
    "title": "Соціальна мережа для постів"
  },
  {
    "votes": 0,
    "description": "Розробіть додаток, який дозволяє користувачам переглядати останні новини за певною темою або ключовими словами.",
    "id": 13,
    "participants": [],
    "skills": "HTML, CSS для простого стилю, використання новинного API для отримання та відображення новин у React.",
    "title": "Додаток для отримання новин"
  },
  {
    "participants": [],
    "skills": "HTML, CSS для базового стилю, використання відеооб\"єктів та керування станом у React для відтворення відео.",
    "title": "Відеоплеєр",
    "votes": 0,
    "description": "Створіть відеоплеєр, який дозволяє відтворювати відео з URL або з власних відеофайлів.",
    "id": 14
  },
  {
    "participants": [],
    "skills": "HTML, CSS для простого дизайну, робота з сервером або фейковим API в React для управління даними в адмін-панелі.",
    "title": "Адмін-панель керування",
    "votes": 0,
    "description": "Розробіть просту адмін-панель для управління даними, де користувачі можуть додавати, редагувати та видаляти різні елементи.",
    "id": 15
  },
  {
    "participants": [],
    "skills": "HTML, CSS для простого макету, робота з картографічним API та управління станом у React для додавання та відображення міток ToDo.",
    "title": "Інтерактивна карта ToDo",
    "votes": 0,
    "description": "Створіть інтерактивну карту, на якій користувачі можуть додавати мітки з завданнями для виконання у певних місцях.",
    "id": 16
  },
  {
    "id": 17,
    "participants": [],
    "skills": "HTML, CSS для простого стилю, генерація випадкових даних та відображення їх у React.",
    "title": "Генератор випадкових користувачів",
    "votes": 0,
    "description": "Розробіть додаток, який генерує випадкові профілі користувачів з даними, такими як ім\"я, вік та фотографія."
  },
  {
    "description": "Створіть додаток, який дозволяє користувачам вести щоденник фізичних тренувань та відстежувати прогрес у фітнесі.",
    "id": 18,
    "participants": [],
    "skills": "HTML, CSS для простого стилю, керування станом у React для ведення щоденника тренувань.",
    "title": "Додаток для відстеження фітнесу",
    "votes": 0
  }
]
